from src.services import simple_search


def test_simple_search(transaction_list) -> None:
    assert simple_search(transaction_list, "людмила") == ('[\n'
 '    {\n'
 '        "MCC": "5411",\n'
 '        "Бонусы (включая кэшбэк)": 0,\n'
 '        "Валюта операции": "RUB",\n'
 '        "Валюта платежа": "RUB",\n'
 '        "Дата операции": "28.10.2024 18:24:55",\n'
 '        "Дата платежа": "28.10.2024",\n'
 '        "Категория": "Супермаркеты",\n'
 '        "Кэшбэк": "",\n'
 '        "Номер карты": "*4529",\n'
 '        "Округление на инвесткопилку": 0,\n'
 '        "Описание": "Людмила П.",\n'
 '        "Статус": "OK",\n'
 '        "Сумма операции": -2450.0,\n'
 '        "Сумма операции с округлением": -2450.0,\n'
 '        "Сумма платежа": -2450.0\n'
 '    }\n'
 ']')
