from src.services import simple_search


def test_simple_search(transaction_list) -> None:
    assert simple_search(transaction_list, "людмила") == """[
    {
        "MCC": "5411",
        "Бонусы (включая кэшбэк)": 0,
        "Валюта операции": "RUB",
        "Валюта платежа": "RUB",
        "Дата операции": "28.10.2024 18:24:55",
        "Дата платежа": "28.10.2024",
        "Категория": "Супермаркеты",
        "Кэшбэк": "",
        "Номер карты": "*4529",
        "Округление на инвесткопилку": 0,
        "Описание": "Людмила П.",
        "Статус": "OK",
        "Сумма операции": -2450.0,
        "Сумма операции с округлением": -2450.0,
        "Сумма платежа": -2450.0
    }
]"""
